# Inroduction
In this section, the main goal is to discover the data and clean it so it becomes ready for all the work needed

# Imports

In [ ]:
# import needed packages/function
import pandas as pd
import sys
import os

sys.path.append(os.path.abspath('../src'))

from data_loader import load_data, save_data

In [ ]:
data = load_data("Churn_Modelling.csv", "Raw", False) # load the data

# Data cleaning

In [ ]:
data.info() # look for any null values

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10000 entries, 0 to 9999
Data columns (total 14 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   RowNumber        10000 non-null  int64
 1   CustomerId       10000 non-null  int64
 2   Surname          10000 non-null  object
 3   CreditScore      10000 non-null  int64
 4   Geography        10000 non-null  object
 5   Gender           10000 non-null  object
 6   Age              10000 non-null  int64
 7   Tenure           10000 non-null  int64
 8   Balance          10000 non-null  float64
 9   NumOfProducts    10000 non-null  int64
 10  HasCrCard        10000 non-null  int64
 11  IsActiveMember   10000 non-null  int64
 12  EstimatedSalary  10000 non-null  float64
 13  Exited           10000 non-null  int64
dtypes: float64(2), int64(9), object(3)
memory usage: 1.1+ MB

In [ ]:
data = data.drop(["RowNumber", "CustomerId", "Surname"], axis=1) # drop irrelevant columns

In [ ]:
data.head(2) # look at the new structure

,CreditScore,Geography,Gender,Age,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,EstimatedSalary,Exited
0,619,France,Female,42,2,0.00,1,1,1,101348.88,1
1,608,Spain,Female,41,1,83807.86,1,0,1,112542.58,0

# Adding age range column

In [ ]:
data.describe() # find min and max values of the ages

,CreditScore,Age,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,EstimatedSalary,Exited
count,10000.000000,10000.000000,10000.000000,10000.000000,10000.000000,10000.00000,10000.000000,10000.000000,10000.000000
mean,650.528800,38.921800,5.012800,76485.889288,1.530200,0.70550,0.515100,100090.239881,0.203700
std,96.653299,10.487806,2.892174,62397.405202,0.581654,0.45584,0.499797,57510.492818,0.402769
min,350.000000,18.000000,0.000000,0.000000,1.000000,0.00000,0.000000,11.580000,0.000000
25%,584.000000,32.000000,3.000000,0.000000,1.000000,0.00000,0.000000,51002.110000,0.000000
50%,652.000000,37.000000,5.000000,97198.540000,1.000000,1.00000,1.000000,100193.915000,0.000000
75%,718.000000,44.000000,7.000000,127644.240000,2.000000,1.00000,1.000000,149388.247500,0.000000
max,850.000000,92.000000,10.000000,250898.090000,4.000000,1.00000,1.000000,199992.480000,1.000000

In [ ]:
# add bins and labels for each age range
bins = [18, 24, 30, 40, 50, 60, 70, 80, 90, 100]
labels = ['18-24', '24-30', '30-40', '40-50', '50-60', '60-70', '70-80', '80-90', '90-100']

data['Age_range'] = pd.cut(data['Age'], bins=bins, labels=labels, right=False) # add the new column

In [ ]:
data.head(2) # just confirm the new column is working

,CreditScore,Geography,Gender,Age,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,EstimatedSalary,Exited,Age_range
0,619,France,Female,42,2,0.00,1,1,1,101348.88,1,40-50
1,608,Spain,Female,41,1,83807.86,1,0,1,112542.58,0,40-50

# Encode gender values

In [ ]:
data['Gender'] = data['Gender'].map({'Male': 0, 'Female': 1}) # map to encode each geneder

In [ ]:
data.head(2) # confirm the gender column is encoded

,CreditScore,Geography,Gender,Age,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,EstimatedSalary,Exited,Age_range
0,619,France,1,42,2,0.00,1,1,1,101348.88,1,40-50
1,608,Spain,1,41,1,83807.86,1,0,1,112542.58,0,40-50

# Save the new data frame

In [22]:
save_data(data, "processed.csv", False)